ahtn/keyplus/efm8/efm8/mcu/EFM8BB3/inc/SI_EFM8BB3_Register_Enums.h
//------------------------------------------------------------------------------
// Copyright 2014 Silicon Laboratories, Inc.
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//Supported Devices:
//  EFM8BB31F16A_4QFN24
//  EFM8BB31F16A_5QFN32
//  EFM8BB31F16G_QFN24
//  EFM8BB31F16G_QFN32
//  EFM8BB31F16G_QFP32
//  EFM8BB31F16G_QSOP24
//  EFM8BB31F16I_4QFN24
//  EFM8BB31F16I_5QFN32
//  EFM8BB31F16I_QFN24
//  EFM8BB31F16I_QFN32
//  EFM8BB31F16I_QFP32
//  EFM8BB31F16I_QSOP24
//  EFM8BB31F32A_4QFN24
//  EFM8BB31F32A_5QFN32
//  EFM8BB31F32G_QFN24
//  EFM8BB31F32G_QFN32
//  EFM8BB31F32G_QFP32
//  EFM8BB31F32G_QSOP24
//  EFM8BB31F32I_4QFN24
//  EFM8BB31F32I_5QFN32
//  EFM8BB31F32I_QFN24
//  EFM8BB31F32I_QFN32
//  EFM8BB31F32I_QFP32
//  EFM8BB31F32I_QSOP24
//  EFM8BB31F64A_4QFN24
//  EFM8BB31F64A_5QFN32
//  EFM8BB31F64G_QFN24
//  EFM8BB31F64G_QFN32
//  EFM8BB31F64G_QFP32
//  EFM8BB31F64G_QSOP24
//  EFM8BB31F64I_4QFN24
//  EFM8BB31F64I_5QFN32
//  EFM8BB31F64I_QFN24
//  EFM8BB31F64I_QFN32
//  EFM8BB31F64I_QFP32
//  EFM8BB31F64I_QSOP24

#ifndef SI_EFM8BB3_REGISTER_ENUMS_H
#define SI_EFM8BB3_REGISTER_ENUMS_H

//Standard device includes
#include "SI_EFM8BB3_Defs.h"
//------------------------------------------------------------------------------
// ADC0ASAH Enums (ADC0 Autoscan Start Address High Byte @ 0xB6)
//------------------------------------------------------------------------------
#define ADC0ASAH_STADDRH__FMASK 0x0F ///< Start Address High
#define ADC0ASAH_STADDRH__SHIFT 0x00 ///< Start Address High
                                                            
//------------------------------------------------------------------------------
// ADC0ASAL Enums (ADC0 Autoscan Start Address Low Byte @ 0xB5)
//------------------------------------------------------------------------------
#define ADC0ASAL_ENDIAN__BMASK         0x01 ///< Endianness Control                             
#define ADC0ASAL_ENDIAN__SHIFT         0x00 ///< Endianness Control                             
#define ADC0ASAL_ENDIAN__BIG_ENDIAN    0x00 ///< ADC results in XRAM are stored in big-endian   
                                            ///< order. This will result in the most significant
                                            ///< byte stored in the even-numbered address.      
#define ADC0ASAL_ENDIAN__LITTLE_ENDIAN 0x01 ///< ADC results in XRAM are stored in little-endian
                                            ///< order. This will result in the most significant
                                            ///< byte stored in the odd-numbered address.       
                                                                                                
#define ADC0ASAL_STADDRL__FMASK        0xFE ///< Start Address Low                              
#define ADC0ASAL_STADDRL__SHIFT        0x01 ///< Start Address Low                              
                                                                                                
//------------------------------------------------------------------------------
// ADC0ASCF Enums (ADC0 Autoscan Configuration @ 0xA1)
//------------------------------------------------------------------------------
#define ADC0ASCF_NASCH__FMASK            0x03 ///< Number of Autoscan Channels                      
#define ADC0ASCF_NASCH__SHIFT            0x00 ///< Number of Autoscan Channels                      
#define ADC0ASCF_NASCH__ONE              0x00 ///< Autoscan will only use the ADC0MX setting        
                                              ///< directly.                                        
#define ADC0ASCF_NASCH__TWO              0x01 ///< Autoscan will alternate between ADC0MX and       
                                              ///< ADC0MX+1.                                        
#define ADC0ASCF_NASCH__THREE            0x02 ///< Autoscan will cycle through ADC0MX, ADC0MX+1 and 
                                              ///< ADC0MX+2.                                        
#define ADC0ASCF_NASCH__FOUR             0x03 ///< Autoscan will cycle through ADC0MX, ADC0MX+1,    
                                              ///< ADC0MX+2, and ADC0MX+3.                          
                                                                                                    
#define ADC0ASCF_ASACT__BMASK            0x20 ///< Autoscan Active                                  
#define ADC0ASCF_ASACT__SHIFT            0x05 ///< Autoscan Active                                  
#define ADC0ASCF_ASACT__NOT_ACTIVE       0x00 ///< No scan is in progress.                          
#define ADC0ASCF_ASACT__ACTIVE           0x20 ///< A scan is in progress.                           
                                                                                                    
#define ADC0ASCF_STEN__BMASK             0x40 ///< Autoscan Single Trigger Enable                   
#define ADC0ASCF_STEN__SHIFT             0x06 ///< Autoscan Single Trigger Enable                   
#define ADC0ASCF_STEN__MULTIPLE_TRIGGERS 0x00 ///< Each conversion in a scan requires a new         
                                              ///< conversion trigger from the selected conversion  
                                              ///< trigger source.                                  
#define ADC0ASCF_STEN__SINGLE_TRIGGER    0x40 ///< The selected conversion trigger source will begin
                                              ///< each scan cycle. All conversions within a scan   
                                              ///< cycle are performed automatically when the       
                                              ///< previous conversion is complete.                 
                                                                                                    
#define ADC0ASCF_ASEN__BMASK             0x80 ///< Autoscan Enable                                  
#define ADC0ASCF_ASEN__SHIFT             0x07 ///< Autoscan Enable                                  
#define ADC0ASCF_ASEN__HALT_SCAN         0x00 ///< Clearing to 0 will halt scan operations once any 
                                              ///< pending scan is complete.                        
#define ADC0ASCF_ASEN__START_SCAN        0x80 ///< Setting to 1 will initialize a scan operation. If
                                              ///< set to 1 at the end of a scan, a new scan will   
                                              ///< begin.                                           
                                                                                                    
//------------------------------------------------------------------------------
// ADC0ASCT Enums (ADC0 Autoscan Output Count @ 0xC7)
//------------------------------------------------------------------------------
#define ADC0ASCT_ASCNT__FMASK 0x3F ///< Autoscan Output Count
#define ADC0ASCT_ASCNT__SHIFT 0x00 ///< Autoscan Output Count
                                                             
//------------------------------------------------------------------------------
// ADC0CF0 Enums (ADC0 Configuration @ 0xBC)
//------------------------------------------------------------------------------
#define ADC0CF0_ADCLKSEL__BMASK  0x04 ///< ADC Clock Select 
#define ADC0CF0_ADCLKSEL__SHIFT  0x02 ///< ADC Clock Select 
#define ADC0CF0_ADCLKSEL__SYSCLK 0x00 ///< ADCCLK = SYSCLK. 
#define ADC0CF0_ADCLKSEL__HFOSC0 0x04 ///< ADCCLK = HFOSC0. 
                                                            
#define ADC0CF0_ADSC__FMASK      0xF8 ///< SAR Clock Divider
#define ADC0CF0_ADSC__SHIFT      0x03 ///< SAR Clock Divider
                                                            
//------------------------------------------------------------------------------
// ADC0CF1 Enums (ADC0 Configuration @ 0xB9)
//------------------------------------------------------------------------------
#define ADC0CF1_ADTK__FMASK        0x3F ///< Conversion Tracking Time
#define ADC0CF1_ADTK__SHIFT        0x00 ///< Conversion Tracking Time
                                                                     
