ahtn/keyplus/efm8/efm8/mcu/EFM8BB3/inc/SI_EFM8BB3_Register_Enums.h
#define ADC0CN2_PACEN__BMASK        0x80 ///< Preserve Accumulator Enable                       
#define ADC0CN2_PACEN__SHIFT        0x07 ///< Preserve Accumulator Enable                       
#define ADC0CN2_PACEN__PAC_DISABLED 0x00 ///< The ADC accumulator is over-written with the      
                                         ///< results of any conversion (or set of conversions  
                                         ///< as specified by ADRPT).                           
#define ADC0CN2_PACEN__PAC_ENABLED  0x80 ///< The ADC accumulator always adds new results to the
                                         ///< existing output. The accumulator is never cleared 
                                         ///< in this mode.                                     
                                                                                                
//------------------------------------------------------------------------------
// ADC0GTH Enums (ADC0 Greater-Than High Byte @ 0xC4)
//------------------------------------------------------------------------------
#define ADC0GTH_ADC0GTH__FMASK 0xFF ///< Greater-Than High Byte
#define ADC0GTH_ADC0GTH__SHIFT 0x00 ///< Greater-Than High Byte
                                                               
//------------------------------------------------------------------------------
// ADC0GTL Enums (ADC0 Greater-Than Low Byte @ 0xC3)
//------------------------------------------------------------------------------
#define ADC0GTL_ADC0GTL__FMASK 0xFF ///< Greater-Than Low Byte
#define ADC0GTL_ADC0GTL__SHIFT 0x00 ///< Greater-Than Low Byte
                                                              
//------------------------------------------------------------------------------
// ADC0H Enums (ADC0 Data Word High Byte @ 0xBE)
//------------------------------------------------------------------------------
#define ADC0H_ADC0H__FMASK 0xFF ///< Data Word High Byte
#define ADC0H_ADC0H__SHIFT 0x00 ///< Data Word High Byte
                                                        
//------------------------------------------------------------------------------
// ADC0L Enums (ADC0 Data Word Low Byte @ 0xBD)
//------------------------------------------------------------------------------
#define ADC0L_ADC0L__FMASK 0xFF ///< Data Word Low Byte
#define ADC0L_ADC0L__SHIFT 0x00 ///< Data Word Low Byte
                                                       
//------------------------------------------------------------------------------
// ADC0LTH Enums (ADC0 Less-Than High Byte @ 0xC6)
//------------------------------------------------------------------------------
#define ADC0LTH_ADC0LTH__FMASK 0xFF ///< Less-Than High Byte
#define ADC0LTH_ADC0LTH__SHIFT 0x00 ///< Less-Than High Byte
                                                            
//------------------------------------------------------------------------------
// ADC0LTL Enums (ADC0 Less-Than Low Byte @ 0xC5)
//------------------------------------------------------------------------------
#define ADC0LTL_ADC0LTL__FMASK 0xFF ///< Less-Than Low Byte
#define ADC0LTL_ADC0LTL__SHIFT 0x00 ///< Less-Than Low Byte
                                                           
//------------------------------------------------------------------------------
// ADC0MX Enums (ADC0 Multiplexer Selection @ 0xBB)
//------------------------------------------------------------------------------
#define ADC0MX_ADC0MX__FMASK   0x1F ///< AMUX0 Positive Input Selection
#define ADC0MX_ADC0MX__SHIFT   0x00 ///< AMUX0 Positive Input Selection
#define ADC0MX_ADC0MX__ADC0P0  0x00 ///< Select ADC0.0.                
#define ADC0MX_ADC0MX__ADC0P1  0x01 ///< Select ADC0.1.                
#define ADC0MX_ADC0MX__ADC0P2  0x02 ///< Select ADC0.2.                
#define ADC0MX_ADC0MX__ADC0P3  0x03 ///< Select ADC0.3.                
#define ADC0MX_ADC0MX__ADC0P4  0x04 ///< Select ADC0.4.                
#define ADC0MX_ADC0MX__ADC0P5  0x05 ///< Select ADC0.5.                
#define ADC0MX_ADC0MX__ADC0P6  0x06 ///< Select ADC0.6.                
#define ADC0MX_ADC0MX__ADC0P7  0x07 ///< Select ADC0.7.                
#define ADC0MX_ADC0MX__ADC0P8  0x08 ///< Select ADC0.8.                
#define ADC0MX_ADC0MX__ADC0P9  0x09 ///< Select ADC0.9.                
#define ADC0MX_ADC0MX__ADC0P10 0x0A ///< Select ADC0.10.               
#define ADC0MX_ADC0MX__ADC0P11 0x0B ///< Select ADC0.11.               
#define ADC0MX_ADC0MX__ADC0P12 0x0C ///< Select ADC0.12.               
#define ADC0MX_ADC0MX__ADC0P13 0x0D ///< Select ADC0.13.               
#define ADC0MX_ADC0MX__ADC0P14 0x0E ///< Select ADC0.14.               
#define ADC0MX_ADC0MX__ADC0P15 0x0F ///< Select ADC0.15.               
#define ADC0MX_ADC0MX__ADC0P16 0x10 ///< Select ADC0.16.               
#define ADC0MX_ADC0MX__ADC0P17 0x11 ///< Select ADC0.17.               
#define ADC0MX_ADC0MX__ADC0P18 0x12 ///< Select ADC0.18.               
#define ADC0MX_ADC0MX__ADC0P19 0x13 ///< Select ADC0.19.               
#define ADC0MX_ADC0MX__TEMP    0x14 ///< Select ADC0.20                
#define ADC0MX_ADC0MX__LDO_OUT 0x15 ///< Select ADC0.21                
#define ADC0MX_ADC0MX__VDD     0x16 ///< Select ADC0.22                
#define ADC0MX_ADC0MX__GND     0x17 ///< Select ADC0.23                
#define ADC0MX_ADC0MX__NONE    0x1F ///< No input selected.            
                                                                       
//------------------------------------------------------------------------------
// ACC Enums (Accumulator @ 0xE0)
//------------------------------------------------------------------------------
#define ACC_ACC__FMASK 0xFF ///< Accumulator
#define ACC_ACC__SHIFT 0x00 ///< Accumulator
                                            
//------------------------------------------------------------------------------
// B Enums (B Register @ 0xF0)
//------------------------------------------------------------------------------
#define B_B__FMASK 0xFF ///< B Register
#define B_B__SHIFT 0x00 ///< B Register
                                       
//------------------------------------------------------------------------------
// DPH Enums (Data Pointer High @ 0x83)
//------------------------------------------------------------------------------
#define DPH_DPH__FMASK 0xFF ///< Data Pointer High
#define DPH_DPH__SHIFT 0x00 ///< Data Pointer High
                                                  
//------------------------------------------------------------------------------
// DPL Enums (Data Pointer Low @ 0x82)
//------------------------------------------------------------------------------
#define DPL_DPL__FMASK 0xFF ///< Data Pointer Low
#define DPL_DPL__SHIFT 0x00 ///< Data Pointer Low
                                                 
//------------------------------------------------------------------------------
// PFE0CN Enums (Prefetch Engine Control @ 0xC1)
//------------------------------------------------------------------------------
#define PFE0CN_FLRT__FMASK               0x30 ///< Flash Read Timing
#define PFE0CN_FLRT__SHIFT               0x04 ///< Flash Read Timing
#define PFE0CN_FLRT__SYSCLK_BELOW_25_MHZ 0x00 ///< SYSCLK < 25 MHz. 
#define PFE0CN_FLRT__SYSCLK_BELOW_50_MHZ 0x10 ///< SYSCLK < 50 MHz. 
                                                                    
//------------------------------------------------------------------------------
// PSW Enums (Program Status Word @ 0xD0)
//------------------------------------------------------------------------------
#define PSW_PARITY__BMASK   0x01 ///< Parity Flag                                       
#define PSW_PARITY__SHIFT   0x00 ///< Parity Flag                                       
#define PSW_PARITY__NOT_SET 0x00 ///< The sum of the 8 bits in the accumulator is even. 
#define PSW_PARITY__SET     0x01 ///< The sum of the 8 bits in the accumulator is odd.  
                                                                                        
#define PSW_F1__BMASK       0x02 ///< User Flag 1                                       
#define PSW_F1__SHIFT       0x01 ///< User Flag 1                                       
#define PSW_F1__NOT_SET     0x00 ///< Flag is not set.                                  
#define PSW_F1__SET         0x02 ///< Flag is set.                                      
                                                                                        
