ahtn/keyplus/efm8/efm8/mcu/EFM8BB3/inc/SI_EFM8BB3_Register_Enums.h
#define DACGCF0_D1AMEN__BMASK      0x04 ///< DAC1 Alternating Mode Enable                      
#define DACGCF0_D1AMEN__SHIFT      0x02 ///< DAC1 Alternating Mode Enable                      
#define DACGCF0_D1AMEN__NORMAL     0x00 ///< DAC1 always updates from the data source selected 
                                        ///< in D1SRC. This mode may be used with any trigger  
                                        ///< source.                                           
#define DACGCF0_D1AMEN__ALTERNATE  0x04 ///< DAC1 updates occur on the rising or falling edge  
                                        ///< of the trigger signal. On a falling edge, DAC1    
                                        ///< receives the DAC1H/L registers. On a rising edge, 
                                        ///< DAC1 receives the data source selected in D1SRC.  
                                        ///< *This mode may only be used with Configurable     
                                        ///< Logic trigger sources, and the selected trigger   
                                        ///< source must be high or low for two or more SYSCLK 
                                        ///< cycles.*                                          
                                                                                               
#define DACGCF0_D01REFSL__BMASK    0x08 ///< DAC0 and DAC1 Reference Voltage Select            
#define DACGCF0_D01REFSL__SHIFT    0x03 ///< DAC0 and DAC1 Reference Voltage Select            
#define DACGCF0_D01REFSL__VREF     0x00 ///< Select the VREF pin.                              
#define DACGCF0_D01REFSL__VDD      0x08 ///< Select the VDD supply.                            
                                                                                               
#define DACGCF0_D3SRC__FMASK       0x30 ///< DAC3 Data Source                                  
#define DACGCF0_D3SRC__SHIFT       0x04 ///< DAC3 Data Source                                  
#define DACGCF0_D3SRC__DAC3        0x00 ///< Input = DAC3H:DAC3L.                              
#define DACGCF0_D3SRC__DAC3_INVERT 0x10 ///< Input = Inverse of DAC3H:DAC3L (one's complement).
#define DACGCF0_D3SRC__DAC2        0x20 ///< Input = DAC2H:DAC2L.                              
#define DACGCF0_D3SRC__DAC2_INVERT 0x30 ///< Input = Inverse of DAC2H:DAC2L (one's complement).
                                                                                               
#define DACGCF0_D3AMEN__BMASK      0x40 ///< DAC3 Alternating Mode Enable                      
#define DACGCF0_D3AMEN__SHIFT      0x06 ///< DAC3 Alternating Mode Enable                      
#define DACGCF0_D3AMEN__NORMAL     0x00 ///< DAC3 always updates from the data source selected 
                                        ///< in D3SRC. This mode may be used with any trigger  
                                        ///< source.                                           
#define DACGCF0_D3AMEN__ALTERNATE  0x40 ///< DAC3 updates occur on the rising or falling edge  
                                        ///< of the trigger signal. On a falling edge, DAC3    
                                        ///< receives the DAC3H/L registers. On a rising edge, 
                                        ///< DAC3 receives the data source selected in D3SRC.  
                                        ///< *This mode may only be used with Configurable     
                                        ///< Logic trigger sources, and the selected trigger   
                                        ///< source must be high or low for two or more SYSCLK 
                                        ///< cycles.*                                          
                                                                                               
#define DACGCF0_D23REFSL__BMASK    0x80 ///< DAC2 and DAC3 Reference Voltage Select            
#define DACGCF0_D23REFSL__SHIFT    0x07 ///< DAC2 and DAC3 Reference Voltage Select            
#define DACGCF0_D23REFSL__VREF     0x00 ///< Select the VREF pin.                              
#define DACGCF0_D23REFSL__VDD      0x80 ///< Select the VDD supply.                            
                                                                                               
//------------------------------------------------------------------------------
// DACGCF1 Enums (DAC Global Configuration 1 @ 0x98)
//------------------------------------------------------------------------------
#define DACGCF1_D0UDIS__BMASK   0x01 ///< DAC0 Update Disable                  
#define DACGCF1_D0UDIS__SHIFT   0x00 ///< DAC0 Update Disable                  
#define DACGCF1_D0UDIS__ENABLE  0x00 ///< Allow triggers to update DAC0 output.
#define DACGCF1_D0UDIS__DISABLE 0x01 ///< Triggers will not update DAC0 output.
                                                                               
#define DACGCF1_D1UDIS__BMASK   0x02 ///< DAC1 Update Disable                  
#define DACGCF1_D1UDIS__SHIFT   0x01 ///< DAC1 Update Disable                  
#define DACGCF1_D1UDIS__ENABLE  0x00 ///< Allow triggers to update DAC1 output.
#define DACGCF1_D1UDIS__DISABLE 0x02 ///< Triggers will not update DAC1 output.
                                                                               
#define DACGCF1_D2UDIS__BMASK   0x04 ///< DAC2 Update Disable                  
#define DACGCF1_D2UDIS__SHIFT   0x02 ///< DAC2 Update Disable                  
#define DACGCF1_D2UDIS__ENABLE  0x00 ///< Allow triggers to update DAC2 output.
#define DACGCF1_D2UDIS__DISABLE 0x04 ///< Triggers will not update DAC2 output.
                                                                               
#define DACGCF1_D3UDIS__BMASK   0x08 ///< DAC3 Update Disable                  
#define DACGCF1_D3UDIS__SHIFT   0x03 ///< DAC3 Update Disable                  
#define DACGCF1_D3UDIS__ENABLE  0x00 ///< Allow triggers to update DAC3 output.
#define DACGCF1_D3UDIS__DISABLE 0x08 ///< Triggers will not update DAC3 output.
                                                                               
//------------------------------------------------------------------------------
// DACGCF2 Enums (DAC Global Configuration 2 @ 0xA2)
//------------------------------------------------------------------------------
#define DACGCF2_D01REFGN__FMASK     0x03 ///< DAC0/1 Reference Buffer Gain                     
#define DACGCF2_D01REFGN__SHIFT     0x00 ///< DAC0/1 Reference Buffer Gain                     
#define DACGCF2_D01REFGN__ATTEN_2P0 0x00 ///< Selected reference will be attenuated by a factor
                                         ///< of 2.                                            
#define DACGCF2_D01REFGN__ATTEN_2P4 0x01 ///< Selected reference will be attenuated by a factor
                                         ///< of 2.4 (Gain = 1/2.4).                           
#define DACGCF2_D01REFGN__ATTEN_3P0 0x02 ///< Selected reference will be attenuated by a factor
                                         ///< of 3 (Gain = 1/3).                               
                                                                                               
#define DACGCF2_D23REFGN__FMASK     0x30 ///< DAC2/3 Reference Buffer Gain                     
#define DACGCF2_D23REFGN__SHIFT     0x04 ///< DAC2/3 Reference Buffer Gain                     
#define DACGCF2_D23REFGN__ATTEN_2P0 0x00 ///< Selected reference will be attenuated by a factor
                                         ///< of 2.                                            
#define DACGCF2_D23REFGN__ATTEN_2P4 0x10 ///< Selected reference will be attenuated by a factor
                                         ///< of 2.4 (Gain = 1/2.4).                           
#define DACGCF2_D23REFGN__ATTEN_3P0 0x20 ///< Selected reference will be attenuated by a factor
                                         ///< of 3 (Gain = 1/3).                               
                                                                                               
//------------------------------------------------------------------------------
// DAC0CF0 Enums (DAC0 Configuration 0 @ 0x91)
//------------------------------------------------------------------------------
#define DAC0CF0_UPDATE__FMASK       0x07 ///< DAC0 Update Trigger Source                        
#define DAC0CF0_UPDATE__SHIFT       0x00 ///< DAC0 Update Trigger Source                        
#define DAC0CF0_UPDATE__SYSCLK      0x00 ///< DAC0 output updates occur on every clock cycle.   
#define DAC0CF0_UPDATE__TIMER3      0x01 ///< DAC0 output updates occur on Timer 3 high byte    
                                         ///< overflow.                                         
#define DAC0CF0_UPDATE__TIMER4      0x02 ///< DAC0 output updates occur on Timer 4 high byte    
                                         ///< overflow.                                         
#define DAC0CF0_UPDATE__TIMER5      0x03 ///< DAC0 output updates occur on Timer 5 high byte    
                                         ///< overflow.                                         
#define DAC0CF0_UPDATE__CLU0        0x04 ///< DAC0 output updates occur on Configurable Logic   
                                         ///< output 0 rising edge.                             
#define DAC0CF0_UPDATE__CLU1        0x05 ///< DAC0 output updates occur on Configurable Logic   
                                         ///< output 1 rising edge.                             
#define DAC0CF0_UPDATE__CLU2        0x06 ///< DAC0 output updates occur on Configurable Logic   
                                         ///< output 2 rising edge.                             
#define DAC0CF0_UPDATE__CLU3        0x07 ///< DAC0 output updates occur on Configurable Logic   
                                         ///< output 3 rising edge.                             
                                                                                                
#define DAC0CF0_LJST__BMASK         0x20 ///< DAC0 Left Justify Enable                          
#define DAC0CF0_LJST__SHIFT         0x05 ///< DAC0 Left Justify Enable                          
#define DAC0CF0_LJST__RIGHT_JUSTIFY 0x00 ///< DAC0 input is treated as right-justified.         
#define DAC0CF0_LJST__LEFT_JUSTIFY  0x20 ///< DAC0 input is treated as left-justified.          
                                                                                                
#define DAC0CF0_RSTMD__BMASK        0x40 ///< DAC0 Reset Mode                                   
#define DAC0CF0_RSTMD__SHIFT        0x06 ///< DAC0 Reset Mode                                   
#define DAC0CF0_RSTMD__NORMAL       0x00 ///< All resets will reset DAC0 and its associated     
                                         ///< registers.                                        
#define DAC0CF0_RSTMD__PERSIST      0x40 ///< DAC0 output will persist through all resets except
                                         ///< for power-on-resets.                              
                                                                                                
