ahtn/keyplus/efm8/efm8/mcu/EFM8BB3/inc/SI_EFM8BB3_Register_Enums.h
#define DAC3CF0_RSTMD__BMASK        0x40 ///< DAC3 Reset Mode                                   
#define DAC3CF0_RSTMD__SHIFT        0x06 ///< DAC3 Reset Mode                                   
#define DAC3CF0_RSTMD__NORMAL       0x00 ///< All resets will reset DAC3 and its associated     
                                         ///< registers.                                        
#define DAC3CF0_RSTMD__PERSIST      0x40 ///< DAC3 output will persist through all resets except
                                         ///< for power-on-resets.                              
                                                                                                
#define DAC3CF0_EN__BMASK           0x80 ///< DAC3 Enable                                       
#define DAC3CF0_EN__SHIFT           0x07 ///< DAC3 Enable                                       
#define DAC3CF0_EN__DISABLE         0x00 ///< DAC3 is disabled and not driven at the output pin.
#define DAC3CF0_EN__ENABLE          0x80 ///< DAC3 is enabled and will drive the output pin.    
                                                                                                
//------------------------------------------------------------------------------
// DAC3CF1 Enums (DAC3 Configuration 1 @ 0x9C)
//------------------------------------------------------------------------------
#define DAC3CF1_DRVGAIN__FMASK    0x03 ///< DAC3 Output Buffer Gain
#define DAC3CF1_DRVGAIN__SHIFT    0x00 ///< DAC3 Output Buffer Gain
#define DAC3CF1_DRVGAIN__GAIN_2P0 0x00 ///< DAC output gain is 2.  
#define DAC3CF1_DRVGAIN__GAIN_2P4 0x01 ///< DAC output gain is 2.4.
#define DAC3CF1_DRVGAIN__GAIN_3P0 0x02 ///< DAC output gain is 3.  
                                                                   
//------------------------------------------------------------------------------
// DAC3H Enums (DAC3 Data Word High Byte @ 0x8E)
//------------------------------------------------------------------------------
#define DAC3H_DAC3H__FMASK 0xFF ///< Data Word High Byte
#define DAC3H_DAC3H__SHIFT 0x00 ///< Data Word High Byte
                                                        
//------------------------------------------------------------------------------
// DAC3L Enums (DAC3 Data Word Low Byte @ 0x8D)
//------------------------------------------------------------------------------
#define DAC3L_DAC3L__FMASK 0xFF ///< Data Word Low Byte
#define DAC3L_DAC3L__SHIFT 0x00 ///< Data Word Low Byte
                                                       
//------------------------------------------------------------------------------
// DERIVID Enums (Derivative Identification @ 0xAD)
//------------------------------------------------------------------------------
#define DERIVID_DERIVID__FMASK               0xFF ///< Derivative ID          
#define DERIVID_DERIVID__SHIFT               0x00 ///< Derivative ID          
#define DERIVID_DERIVID__EFM8BB31F64G_QFN32  0x01 ///< EFM8BB31F64G-{R}-QFN32 
#define DERIVID_DERIVID__EFM8BB31F64G_QFP32  0x02 ///< EFM8BB31F64G-{R}-QFP32 
#define DERIVID_DERIVID__EFM8BB31F64G_QSOP24 0x03 ///< EFM8BB31F64G-{R}-QSOP24
#define DERIVID_DERIVID__EFM8BB31F64G_QFN24  0x04 ///< EFM8BB31F64G-{R}-QFN24 
#define DERIVID_DERIVID__EFM8BB31F32G_QFN32  0x05 ///< EFM8BB31F32G-{R}-QFN32 
#define DERIVID_DERIVID__EFM8BB31F32G_QFP32  0x06 ///< EFM8BB31F32G-{R}-QFP32 
#define DERIVID_DERIVID__EFM8BB31F32G_QSOP24 0x07 ///< EFM8BB31F32G-{R}-QSOP24
#define DERIVID_DERIVID__EFM8BB31F32G_QFN24  0x08 ///< EFM8BB31F32G-{R}-QFN24 
#define DERIVID_DERIVID__EFM8BB31F16G_QFN32  0x09 ///< EFM8BB31F16G-{R}-QFN32 
#define DERIVID_DERIVID__EFM8BB31F16G_QFP32  0x0A ///< EFM8BB31F16G-{R}-QFP32 
#define DERIVID_DERIVID__EFM8BB31F16G_QSOP24 0x0B ///< EFM8BB31F16G-{R}-QSOP24
#define DERIVID_DERIVID__EFM8BB31F64I_QFN32  0x11 ///< EFM8BB31F64I-{R}-QFN32 
#define DERIVID_DERIVID__EFM8BB31F64I_QFP32  0x12 ///< EFM8BB31F64I-{R}-QFP32 
#define DERIVID_DERIVID__EFM8BB31F64I_QSOP24 0x13 ///< EFM8BB31F64I-{R}-QSOP24
#define DERIVID_DERIVID__EFM8BB31F64I_QFN24  0x14 ///< EFM8BB31F64I-{R}-QFN24 
#define DERIVID_DERIVID__EFM8BB31F32I_QFN32  0x15 ///< EFM8BB31F32I-{R}-QFN32 
#define DERIVID_DERIVID__EFM8BB31F32I_QFP32  0x16 ///< EFM8BB31F32I-{R}-QFP32 
#define DERIVID_DERIVID__EFM8BB31F32I_QSOP24 0x17 ///< EFM8BB31F32I-{R}-QSOP24
#define DERIVID_DERIVID__EFM8BB31F32I_QFN24  0x19 ///< EFM8BB31F32I-{R}-QFN24 
                                                                              
//------------------------------------------------------------------------------
// DEVICEID Enums (Device Identification @ 0xB5)
//------------------------------------------------------------------------------
#define DEVICEID_DEVICEID__FMASK 0xFF ///< Device ID
#define DEVICEID_DEVICEID__SHIFT 0x00 ///< Device ID
                                                    
//------------------------------------------------------------------------------
// REVID Enums (Revision Identifcation @ 0xB6)
//------------------------------------------------------------------------------
#define REVID_REVID__FMASK 0xFF ///< Revision ID
#define REVID_REVID__SHIFT 0x00 ///< Revision ID
#define REVID_REVID__REV_A 0x00 ///< Revision A.
                                                
//------------------------------------------------------------------------------
// IT01CF Enums (INT0/INT1 Configuration @ 0xE4)
//------------------------------------------------------------------------------
#define IT01CF_IN0SL__FMASK       0x07 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__SHIFT       0x00 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__P0_0        0x00 ///< Select P0.0.              
#define IT01CF_IN0SL__P0_1        0x01 ///< Select P0.1.              
#define IT01CF_IN0SL__P0_2        0x02 ///< Select P0.2.              
#define IT01CF_IN0SL__P0_3        0x03 ///< Select P0.3.              
#define IT01CF_IN0SL__P0_4        0x04 ///< Select P0.4.              
#define IT01CF_IN0SL__P0_5        0x05 ///< Select P0.5.              
#define IT01CF_IN0SL__P0_6        0x06 ///< Select P0.6.              
#define IT01CF_IN0SL__P0_7        0x07 ///< Select P0.7.              
                                                                      
