ahtn/keyplus/efm8/efm8/mcu/EFM8BB3/inc/SI_EFM8BB3_Register_Enums.h
#define SPI0CN0_SPIF__BMASK                   0x80 ///< SPI0 Interrupt Flag                               
#define SPI0CN0_SPIF__SHIFT                   0x07 ///< SPI0 Interrupt Flag                               
#define SPI0CN0_SPIF__NOT_SET                 0x00 ///< A data transfer has not completed since the last  
                                                   ///< time SPIF was cleared.                            
#define SPI0CN0_SPIF__SET                     0x80 ///< A data transfer completed.                        
                                                                                                          
//------------------------------------------------------------------------------
// SPI0DAT Enums (SPI0 Data @ 0xA3)
//------------------------------------------------------------------------------
#define SPI0DAT_SPI0DAT__FMASK 0xFF ///< SPI0 Transmit and Receive Data
#define SPI0DAT_SPI0DAT__SHIFT 0x00 ///< SPI0 Transmit and Receive Data
                                                                       
//------------------------------------------------------------------------------
// SPI0FCN0 Enums (SPI0 FIFO Control 0 @ 0x9A)
//------------------------------------------------------------------------------
#define SPI0FCN0_RXTH__FMASK     0x03 ///< RX FIFO Threshold                                 
#define SPI0FCN0_RXTH__SHIFT     0x00 ///< RX FIFO Threshold                                 
#define SPI0FCN0_RXTH__ZERO      0x00 ///< RFRQ will be set anytime new data arrives in the  
                                      ///< RX FIFO (when the RX FIFO is not empty).          
#define SPI0FCN0_RXTH__ONE       0x01 ///< RFRQ will be set if the RX FIFO contains more than
                                      ///< one byte.                                         
                                                                                             
#define SPI0FCN0_RFLSH__BMASK    0x04 ///< RX FIFO Flush                                     
#define SPI0FCN0_RFLSH__SHIFT    0x02 ///< RX FIFO Flush                                     
#define SPI0FCN0_RFLSH__FLUSH    0x04 ///< Initiate an RX FIFO flush.                        
                                                                                             
#define SPI0FCN0_RFRQE__BMASK    0x08 ///< Read Request Interrupt Enable                     
#define SPI0FCN0_RFRQE__SHIFT    0x03 ///< Read Request Interrupt Enable                     
#define SPI0FCN0_RFRQE__DISABLED 0x00 ///< SPI0 interrupts will not be generated when RFRQ is
                                      ///< set.                                              
#define SPI0FCN0_RFRQE__ENABLED  0x08 ///< SPI0 interrupts will be generated if RFRQ is set. 
                                                                                             
#define SPI0FCN0_TXTH__FMASK     0x30 ///< TX FIFO Threshold                                 
#define SPI0FCN0_TXTH__SHIFT     0x04 ///< TX FIFO Threshold                                 
#define SPI0FCN0_TXTH__ZERO      0x00 ///< TFRQ will be set when the TX FIFO is empty.       
#define SPI0FCN0_TXTH__ONE       0x10 ///< TFRQ will be set when the TX FIFO contains one or 
                                      ///< fewer bytes.                                      
                                                                                             
#define SPI0FCN0_TFLSH__BMASK    0x40 ///< TX FIFO Flush                                     
#define SPI0FCN0_TFLSH__SHIFT    0x06 ///< TX FIFO Flush                                     
#define SPI0FCN0_TFLSH__FLUSH    0x40 ///< Initiate a TX FIFO flush.                         
                                                                                             
#define SPI0FCN0_TFRQE__BMASK    0x80 ///< Write Request Interrupt Enable                    
#define SPI0FCN0_TFRQE__SHIFT    0x07 ///< Write Request Interrupt Enable                    
#define SPI0FCN0_TFRQE__DISABLED 0x00 ///< SPI0 interrupts will not be generated when TFRQ is
                                      ///< set.                                              
#define SPI0FCN0_TFRQE__ENABLED  0x80 ///< SPI0 interrupts will be generated if TFRQ is set. 
                                                                                             
//------------------------------------------------------------------------------
// SPI0FCN1 Enums (SPI0 FIFO Control 1 @ 0x9B)
//------------------------------------------------------------------------------
#define SPI0FCN1_RXFIFOE__BMASK    0x01 ///< Receive FIFO Enable                               
#define SPI0FCN1_RXFIFOE__SHIFT    0x00 ///< Receive FIFO Enable                               
#define SPI0FCN1_RXFIFOE__DISABLED 0x00 ///< Received bytes will be discarded.                 
#define SPI0FCN1_RXFIFOE__ENABLED  0x01 ///< Received bytes will be placed in the RX FIFO.     
                                                                                               
#define SPI0FCN1_RXTOE__BMASK      0x02 ///< Receive Timeout Enable                            
#define SPI0FCN1_RXTOE__SHIFT      0x01 ///< Receive Timeout Enable                            
#define SPI0FCN1_RXTOE__DISABLED   0x00 ///< Lingering bytes in the RX FIFO will not generate  
                                        ///< an interrupt.                                     
#define SPI0FCN1_RXTOE__ENABLED    0x02 ///< Lingering bytes in the RX FIFO will generate an   
                                        ///< interrupt after timeout.                          
                                                                                               
#define SPI0FCN1_RFRQ__BMASK       0x08 ///< Receive FIFO Request                              
#define SPI0FCN1_RFRQ__SHIFT       0x03 ///< Receive FIFO Request                              
#define SPI0FCN1_RFRQ__NOT_SET     0x00 ///< The number of bytes in the RX FIFO is less than or
                                        ///< equal to RXTH.                                    
#define SPI0FCN1_RFRQ__SET         0x08 ///< The number of bytes in the RX FIFO is greater than
                                        ///< RXTH.                                             
                                                                                               
#define SPI0FCN1_SPIFEN__BMASK     0x10 ///< SPIF Interrupt Enable                             
#define SPI0FCN1_SPIFEN__SHIFT     0x04 ///< SPIF Interrupt Enable                             
#define SPI0FCN1_SPIFEN__DISABLED  0x00 ///< SPI0 interrupts will not be generated when SPIF is
                                        ///< set.                                              
#define SPI0FCN1_SPIFEN__ENABLED   0x10 ///< SPI0 interrupts will be generated if SPIF is set. 
                                                                                               
#define SPI0FCN1_TXHOLD__BMASK     0x20 ///< Transmit Hold                                     
#define SPI0FCN1_TXHOLD__SHIFT     0x05 ///< Transmit Hold                                     
#define SPI0FCN1_TXHOLD__CONTINUE  0x00 ///< The UART will continue to transmit any available  
                                        ///< data in the TX FIFO.                              
#define SPI0FCN1_TXHOLD__HOLD      0x20 ///< The UART will not transmit any new data from the  
                                        ///< TX FIFO.                                          
                                                                                               
#define SPI0FCN1_THPOL__BMASK      0x40 ///< Transmit Hold Polarity                            
#define SPI0FCN1_THPOL__SHIFT      0x06 ///< Transmit Hold Polarity                            
#define SPI0FCN1_THPOL__HOLD_0     0x00 ///< Data output will be held at logic low when TXHOLD 
                                        ///< is set.                                           
#define SPI0FCN1_THPOL__HOLD_1     0x40 ///< Data output will be held at logic high when TXHOLD
                                        ///< is set.                                           
                                                                                               
#define SPI0FCN1_TFRQ__BMASK       0x80 ///< Transmit FIFO Request                             
#define SPI0FCN1_TFRQ__SHIFT       0x07 ///< Transmit FIFO Request                             
#define SPI0FCN1_TFRQ__NOT_SET     0x00 ///< The number of bytes in the TX FIFO is greater than
                                        ///< TXTH.                                             
#define SPI0FCN1_TFRQ__SET         0x80 ///< The number of bytes in the TX FIFO is less than or
                                        ///< equal to TXTH.                                    
                                                                                               
//------------------------------------------------------------------------------
// SPI0FCT Enums (SPI0 FIFO Count @ 0xF7)
//------------------------------------------------------------------------------
#define SPI0FCT_RXCNT__FMASK 0x07 ///< RX FIFO Count
#define SPI0FCT_RXCNT__SHIFT 0x00 ///< RX FIFO Count
                                                    
#define SPI0FCT_TXCNT__FMASK 0x70 ///< TX FIFO Count
#define SPI0FCT_TXCNT__SHIFT 0x04 ///< TX FIFO Count
                                                    
//------------------------------------------------------------------------------
// SPI0PCF Enums (SPI0 Pin Configuration @ 0xDF)
//------------------------------------------------------------------------------
#define SPI0PCF_SISEL__BMASK     0x01 ///< Slave Data Input Select                           
#define SPI0PCF_SISEL__SHIFT     0x00 ///< Slave Data Input Select                           
#define SPI0PCF_SISEL__CROSSBAR  0x00 ///< MOSI (slave mode data input) is connected to the  
                                      ///< pin assigned by the crossbar.                     
#define SPI0PCF_SISEL__CLU3      0x01 ///< MOSI (slave mode data input) is connected to the  
                                      ///< CLU3 output.                                      
                                                                                             
#define SPI0PCF_MISEL__BMASK     0x02 ///< Master Data Input Select                          
#define SPI0PCF_MISEL__SHIFT     0x01 ///< Master Data Input Select                          
#define SPI0PCF_MISEL__CROSSBAR  0x00 ///< MISO (master mode data input) is connected to the 
                                      ///< pin assigned by the crossbar.                     
#define SPI0PCF_MISEL__CLU2      0x02 ///< MISO (master mode data input)  is connected to the
                                      ///< CLU2 output.                                      
                                                                                             
#define SPI0PCF_SCKSEL__BMASK    0x04 ///< Slave Clock Input Select                          
#define SPI0PCF_SCKSEL__SHIFT    0x02 ///< Slave Clock Input Select                          
#define SPI0PCF_SCKSEL__CROSSBAR 0x00 ///< SCK (slave mode clock input) is connected to the  
                                      ///< pin assigned by the crossbar.                     
#define SPI0PCF_SCKSEL__CLU1     0x04 ///< SCK (slave mode clock input) is connected to the  
                                      ///< CLU1 output.                                      
                                                                                             
//------------------------------------------------------------------------------
// TH0 Enums (Timer 0 High Byte @ 0x8C)
//------------------------------------------------------------------------------
#define TH0_TH0__FMASK 0xFF ///< Timer 0 High Byte
#define TH0_TH0__SHIFT 0x00 ///< Timer 0 High Byte
                                                  
//------------------------------------------------------------------------------
// TH1 Enums (Timer 1 High Byte @ 0x8D)
//------------------------------------------------------------------------------
#define TH1_TH1__FMASK 0xFF ///< Timer 1 High Byte
#define TH1_TH1__SHIFT 0x00 ///< Timer 1 High Byte
                                                  
//------------------------------------------------------------------------------
// TL0 Enums (Timer 0 Low Byte @ 0x8A)
//------------------------------------------------------------------------------
#define TL0_TL0__FMASK 0xFF ///< Timer 0 Low Byte
#define TL0_TL0__SHIFT 0x00 ///< Timer 0 Low Byte
                                                 
//------------------------------------------------------------------------------
// TL1 Enums (Timer 1 Low Byte @ 0x8B)
//------------------------------------------------------------------------------
#define TL1_TL1__FMASK 0xFF ///< Timer 1 Low Byte
#define TL1_TL1__SHIFT 0x00 ///< Timer 1 Low Byte
                                                 
//------------------------------------------------------------------------------
// TMR2CN0 Enums (Timer 2 Control 0 @ 0xC8)
//------------------------------------------------------------------------------
#define TMR2CN0_T2XCLK__FMASK          0x03 ///< Timer 2 External Clock Select                     
#define TMR2CN0_T2XCLK__SHIFT          0x00 ///< Timer 2 External Clock Select                     
#define TMR2CN0_T2XCLK__SYSCLK_DIV_12  0x00 ///< Timer 2 clock is the system clock divided by 12.  
#define TMR2CN0_T2XCLK__EXTOSC_DIV_8   0x01 ///< Timer 2 clock is the external oscillator divided  
                                            ///< by 8 (synchronized with SYSCLK when not in suspend
                                            ///< or snooze mode).                                  
                                                                                                   
#define TMR2CN0_TR2__BMASK             0x04 ///< Timer 2 Run Control                               
#define TMR2CN0_TR2__SHIFT             0x02 ///< Timer 2 Run Control                               
#define TMR2CN0_TR2__STOP              0x00 ///< Stop Timer 2.                                     
#define TMR2CN0_TR2__RUN               0x04 ///< Start Timer 2 running.                            
                                                                                                   
#define TMR2CN0_T2SPLIT__BMASK         0x08 ///< Timer 2 Split Mode Enable                         
#define TMR2CN0_T2SPLIT__SHIFT         0x03 ///< Timer 2 Split Mode Enable                         
#define TMR2CN0_T2SPLIT__16_BIT_RELOAD 0x00 ///< Timer 2 operates in 16-bit auto-reload mode.      
#define TMR2CN0_T2SPLIT__8_BIT_RELOAD  0x08 ///< Timer 2 operates as two 8-bit auto-reload timers. 
                                                                                                   
#define TMR2CN0_TF2CEN__BMASK          0x10 ///< Timer 2 Capture Enable                            
#define TMR2CN0_TF2CEN__SHIFT          0x04 ///< Timer 2 Capture Enable                            
#define TMR2CN0_TF2CEN__DISABLED       0x00 ///< Disable capture mode.                             
#define TMR2CN0_TF2CEN__ENABLED        0x10 ///< Enable capture mode.                              
                                                                                                   
#define TMR2CN0_TF2LEN__BMASK          0x20 ///< Timer 2 Low Byte Interrupt Enable                 
#define TMR2CN0_TF2LEN__SHIFT          0x05 ///< Timer 2 Low Byte Interrupt Enable                 
#define TMR2CN0_TF2LEN__DISABLED       0x00 ///< Disable low byte interrupts.                      
#define TMR2CN0_TF2LEN__ENABLED        0x20 ///< Enable low byte interrupts.                       
                                                                                                   
